Zalmotek/zalmotek-RA2E1-feather/firmware/I2C/Ra2E1_Feather_IIC_MASTER_ADXL345/src/hal_entry.cpp
#include "hal_data.h"
#include "common_utils.h"
#include "SerialCompatibility.h"
#include "i2c_sensor.h"

FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER

void delay(int t);
void delay(int t) {
    R_BSP_SoftwareDelay(t, BSP_DELAY_UNITS_MILLISECONDS);
}

void print_float(float n);
void print_float(float n) {
    int p = 1;
    long long aux;
    if (n < 1) {
        Serial.print((uint8_t*)"0.");
        aux = ((int)(n * 10) % 10);
        Serial.print(aux);
        aux = (int)(n * 100) % 10;
        Serial.print(aux);
        return;
    }

    aux = n;
    Serial.print(aux);
    Serial.print((uint8_t*)".");
    aux = ((int)(n * 10) % 10);
    Serial.print(aux);
    aux = (int)(n * 100) % 10;
    Serial.print(aux);
}

/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    R_IOPORT_Open(&g_ioport_ctrl, &g_bsp_pin_cfg);
    R_BSP_PinAccessEnable();

    Serial.begin(115200);

    uint8_t xyz_axis[6]      = {RESET_VALUE};
    float x_axis            = 0.0f;
    float y_axis            = 0.0f;
    float z_axis            = 0.0f;

    init_sensor();
    APP_PRINT("Sensor initialized.\n");
    Serial.print((uint8_t*) "Sensor initialized");

    while (true) {
        // Read the accelerometer data
        read_sensor_data(xyz_axis);

        // Process the raw sensor data into x, y, z axis values
        x_axis = (float)(xyz_axis[0] | (xyz_axis[1] << 8));
        y_axis = (float)(xyz_axis[2] | (xyz_axis[3] << 8));
        z_axis = (float)(xyz_axis[4] | (xyz_axis[5] << 8));

        // Check if sensor data is valid
        if ((int)x_axis == 0 && (int)y_axis == 0 && (int)z_axis == 0) {
            APP_PRINT("Invalid sensor data.\n");
            i2cok = 0;
        }

        Serial.print((uint8_t*) "Computation status [");
        Serial.print((uint8_t*) "\033[0;42mOK\033[0m");
        Serial.print((uint8_t*)"]");
        Serial.print((uint8_t*) ", ");

        Serial.print((uint8_t*) "I2C status [");
        if (i2cok) {
            Serial.print((uint8_t*) "\033[0;42mOK\033[0m");
        }
        else {
            Serial.print((uint8_t*) "\033[0;41mNOK\033[0m");
        }

        Serial.print((uint8_t*)"]");
        Serial.print((uint8_t*) ", ");

        Serial.print((uint8_t*) "acceleration(x, y, z) [");
        if (i2cok) {
            print_float(x_axis);
        }
        Serial.print((uint8_t*)"]");
        Serial.print((uint8_t*)"[");
        if (i2cok) {
            print_float(y_axis);
        }
        Serial.print((uint8_t*)"]");
        Serial.print((uint8_t*)"[");
        if (i2cok) {
            print_float(z_axis);
        }

        Serial.print((uint8_t*)"]");
        Serial.print((uint8_t*) "\r\n");

        delay(1000);

        APP_PRINT("X: %d, Y: %d, Z: %d\n", (int)x_axis, (int)y_axis, (int)z_axis);

    }

#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open (&IOPORT_CFG_CTRL, &IOPORT_CFG_NAME);

#if BSP_CFG_SDRAM_ENABLED

        /* Setup SDRAM and initialize it. Must configure pins first. */
        R_BSP_SdramInit(true);
#endif
    }
}

#if BSP_TZ_SECURE_BUILD

FSP_CPP_HEADER
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
FSP_CPP_FOOTER

#endif
